Repository: firebase/flutterfire
Catalog: packages/firebase_ui_localizations/lib/l10n/firebase_ui_*.arb
Languages: ru, th

# accessDisabledErrorText
source: Access to this account has been temporarily disabled
ru: Доступ к этому аккаунту временно заблокирован.
th: มีการปิดใช้สิทธิ์เข้าถึงบัญชีนี้ชั่วคราว

# arrayLabel
source: array
ru: массив
th: อาร์เรย์

# booleanLabel
source: Boolean
ru: логическое значение
th: บูลีน

# cancelLabel
source: cancel
ru: отменить
th: ยกเลิก

source: Choose a country
ru: Choose a country (Выберите страну)
th: เลือกประเทศ

# confirmPasswordDoesNotMatchErrorText
source: Passwords do not match
ru: Пароли не совпадают.
th: รหัสผ่านไม่ตรงกัน

# confirmPasswordInputLabel
source: Confirm password
ru: Confirm password (Введите пароль ещё раз)
th: ยืนยันรหัสผ่าน

# confirmPasswordIsRequiredErrorText
source: Confirm your password
ru: Подтвердите пароль
th: ยืนยันรหัสผ่าน

# continueText
source: Continue
ru: Continue (Далее)
th: ต่อไป

# countryCode
source: Code
ru: Code (Код)
th: รหัส

# credentialAlreadyInUseErrorText
source: This provider is associated with a different user account.
ru: Этот поставщик связан с аккаунтом другого пользователя.
th: ผู้ให้บริการรายนี้เชื่อมโยงกับบัญชีผู้ใช้อื่นอยู่

source: Delete account
ru: Delete account (Удалить аккаунт)
th: ลบบัญชี

# differentMethodsSignInTitleText
source: Use one of the following methods to sign in
ru: Используйте один из следующих способов для входа
th: ใช้วิธีใดวิธีหนึ่งต่อไปนี้เพื่อลงชื่อเข้าใช้

source: Disable
ru: Disable (Отключить)
th: ปิดใช้

# emailInputLabel
source: Email
ru: Email (Электронная почта)
th: อีเมล

# emailIsRequiredErrorText
source: Email is required
ru: Укажите адрес электронной почты.
th: ต้องระบุอีเมล

# emailLinkSignInButtonLabel
source: Sign in with magic link
ru: Sign in with magic link (Войти по ссылке)
th: ลงชื่อเข้าใช้ด้วยลิงก์วิเศษ

# emailTakenErrorText
source: An account with this email already exists
ru: К этой электронной почте уже привязан аккаунт.
th: มีบัญชีที่ใช้อีเมลดังกล่าวอยู่แล้ว

source: Enable
ru: Enable (Включить)
th: เปิดใช้

source: Enable more sign-in methods
ru: Включить больше способов для входа.
th: เปิดใช้วิธีการลงชื่อเข้าใช้เพิ่มเติม

# enterSMSCodeText
source: Enter SMS code
ru: Enter SMS code (Ввести код из SMS)
th: ป้อนรหัส SMS

# findProviderForEmailTitleText
source: Enter your email to continue
ru: Введите свой адрес электронной почты, чтобы продолжить
th: ป้อนอีเมลเพื่อดำเนินการต่อ

# forgotPasswordButtonLabel
source: Forgotten password?
ru: Forgot password? (Забыли пароль?)
th: หากลืมรหัสผ่าน

# forgotPasswordHintText
source: Provide your email and we will send you a link to reset your password
ru: Укажите свой адрес электронной почты, чтобы получить ссылку для сброса пароля.
th: โปรดป้อนอีเมลแล้วเราจะส่งลิงก์สำหรับรีเซ็ตรหัสผ่านให้คุณ

# forgotPasswordViewTitle
source: Forgotten password
ru: Не помню пароль
th: ลืมรหัสผ่าน

# geopointLabel
source: geopoint
ru: геоточка
th: พิกัดภูมิศาสตร์

# goBackButtonLabel
source: Go back
ru: Go back (Назад)
th: ย้อนกลับ

# invalidCountryCode
source: Invalid code
ru: Неверный код.
th: รหัสไม่ถูกต้อง

# isNotAValidEmailErrorText
source: Provide a valid email
ru: Укажите действительный адрес электронной почты.
th: โปรดป้อนอีเมลที่ถูกต้อง

# latitudeLabel
source: latitude
ru: широта
th: ละติจูด

# linkEmailButtonText
source: Next
ru: Далее
th: ถัดไป

# longitudeLabel
source: longitude
ru: долгота
th: ลองจิจูด

# mapLabel
source: map
ru: карта
th: แผนที่

# mfaTitle
source: 2-Step Verification
ru: Двухэтапная аутентификация
th: การยืนยันแบบ 2 ขั้นตอน

source: Name
ru: Название
th: ชื่อ

# numberLabel
source: number
ru: число
th: หมายเลข

source: Off
ru: Off (Откл.)
th: ปิดอยู่

source: On
ru: On (Вкл.)
th: เปิดอยู่

# passwordInputLabel
source: Password
ru: Password (Пароль)
th: รหัสผ่าน

# passwordIsRequiredErrorText
source: Password is required
ru: Укажите пароль.
th: ต้องระบุรหัสผ่าน

# passwordResetEmailSentText
source: We've sent you an email with a link to reset your password. Please check your emails.
ru: Мы отправили вам электронное письмо со ссылкой для сброса пароля. Проверьте почту.
th: เราส่งอีเมลพร้อมกับลิงก์รีเซ็ตรหัสผ่านให้คุณแล้ว โปรดตรวจสอบอีเมลของคุณ

# phoneInputLabel
source: Phone number
ru: Phone number (Номер телефона)
th: หมายเลขโทรศัพท์

# phoneNumberInvalidErrorText
source: Phone number is invalid
ru: Недействительный номер телефона.
th: หมายเลขโทรศัพท์ไม่ถูกต้อง

# phoneNumberIsRequiredErrorText
source: Phone number is required
ru: Укажите номер телефона.
th: ต้องระบุหมายเลขโทรศัพท์

# phoneVerificationViewTitleText
source: Enter your phone number
ru: Введите номер телефона
th: ป้อนหมายเลขโทรศัพท์ของคุณ

source: Profile
ru: Профиль
th: โปรไฟล์

# provideEmail
source: Provide your email and password
ru: Укажите адрес электронной почты и пароль
th: ป้อนอีเมลและรหัสผ่าน

# referenceLabel
source: reference
ru: ссылка
th: การอ้างอิง

# registerActionText
source: Register
ru: Register (Зарегистрировать)
th: ลงทะเบียน

# registerHintText
source: Don't have an account?
ru: У вас ещё нет аккаунта?
th: หากคุณยังไม่มีบัญชี

# registerText
source: Register
ru: Register (Зарегистрировать)
th: ลงทะเบียน

# resetPasswordButtonLabel
source: Reset password
ru: Reset password (Сбросить пароль)
th: รีเซ็ตรหัสผ่าน

# sendLinkButtonLabel
source: Send magic link
ru: Send magic link (Отправить ссылку)
th: ส่งลิงก์วิเศษ

# signInActionText
source: Sign in
ru: Sign in (Войти)
th: ลงชื่อเข้าใช้

# signInHintText
source: Already have an account?
ru: Уже зарегистрированы?
th: หากมีบัญชีอยู่แล้ว

source: Sign-in methods
ru: Sign in methods (Как войти в систему)
th: วิธีลงชื่อเข้าใช้

# signInText
source: Sign in
ru: Sign in (Войти)
th: ลงชื่อเข้าใช้

# signInWithAppleButtonText
source: Sign in with Apple
ru: Sign in with Apple (Войти через аккаунт Apple)
th: ลงชื่อเข้าใช้ด้วย Apple

# signInWithEmailLinkSentText
source: We've sent you an email with a magic link. Check your email and follow the link to sign in
ru: Мы отправили вам электронное письмо со ссылкой. Проверьте свой ящик и перейдите по ссылке, чтобы войти в систему.
th: เราส่งอีเมลพร้อมกับลิงก์วิเศษให้คุณแล้ว โปรดตรวจสอบอีเมลแล้วไปที่ลิงก์ดังกล่าวเพื่อลงชื่อเข้าใช้

# signInWithEmailLinkViewTitleText
source: Sign in with magic link
ru: Sign in with magic link (Войти по ссылке)
th: ลงชื่อเข้าใช้ด้วยลิงก์วิเศษ

# signInWithFacebookButtonText
source: Sign in with Facebook
ru: Sign in with Facebook (Войти через аккаунт Facebook)
th: ลงชื่อเข้าใช้ด้วย Facebook

# signInWithGoogleButtonText
source: Sign in with Google
ru: Sign in with Google (Войти с аккаунтом Google)
th: ลงชื่อเข้าใช้ด้วย Google

# signInWithPhoneButtonText
source: Sign in with phone
ru: Sign in with phone (Войти по номеру телефона)
th: ลงชื่อเข้าใช้ด้วยโทรศัพท์

# signInWithTwitterButtonText
source: Sign in with Twitter
ru: Sign in with Twitter (Войти через аккаунт Twitter)
th: ลงชื่อเข้าใช้ด้วย Twitter

# signOutButtonText
source: Sign out
ru: Sign out (Выйти)
th: ออกจากระบบ

# smsAutoresolutionFailedError
source: Failed to resolve SMS code automatically. Please enter your code manually
ru: Не удалось автоматически подставить код из SMS. Введите свой код вручную.
th: แก้ไขรหัส SMS โดยอัตโนมัติไม่ได้ โปรดป้อนรหัสด้วยตนเอง

# stringLabel
source: string
ru: строка
th: สตริง

# timestampLabel
source: timestamp
ru: временная метка
th: การประทับเวลา

# typeLabel
source: type
ru: тип
th: ประเภท

# unknownError
source: An unknown error occurred
ru: Произошла неизвестная ошибка.
th: เกิดข้อผิดพลาดที่ไม่รู้จัก

# updateLabel
source: update
ru: обновление
th: อัปเดต

# userNotFoundErrorText
source: Account doesn't exist
ru: Аккаунт не существует.
th: ไม่มีบัญชีนี้

# valueLabel
source: value
ru: значение
th: ค่า

# verifyCodeButtonText
source: Verify
ru: Verify (Подтвердить)
th: ยืนยัน

# verifyingSMSCodeText
source: Verifying SMS codeâ€¦
ru: Идет подтверждение кода из SMS...
th: กำลังยืนยันรหัส SMS...

# verifyItsYouText
source: Verify that it's you
ru: Подтверждение личности
th: ยืนยันว่าเป็นคุณ

# verifyPhoneNumberButtonText
source: Next
ru: Далее
th: ถัดไป

# wrongOrNoPasswordErrorText
source: The password is invalid or the user does not have a password
ru: Пароль недействителен или не установлен для этого пользователя.
th: รหัสผ่านไม่ถูกต้องหรือผู้ใช้ไม่มีรหัสผ่าน
